tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "beeftornado/rmtree"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "weaveworks/tap"
brew "automake"
brew "awscli"
brew "cairo"
brew "cocoapods"
brew "coreutils"
brew "docker-credential-helper-ecr", link: false
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git-flow"
brew "git-lfs"
brew "git"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "guile"
brew "harfbuzz"
brew "hashicorp/tap/terraform"
brew "helm"
brew "isl"
brew "jenv"
brew "jq"
brew "kind"
brew "kompose"
brew "kubernetes-cli"
brew "libmpc"
brew "librsvg"
brew "libyaml"
brew "minikube"
brew "nghttp2"
brew "nvm"
brew "openjdk"
brew "pango"
brew "pinentry-mac"
brew "protobuf"
brew "python@3.9"
brew "rbenv"
brew "ruby-build"
brew "ruby"
brew "sqlite"
brew "tree"
brew "unbound"
brew "watchman"
brew "weaveworks/tap/eksctl"
brew "yq"
brew "zlib"
cask "adoptopenjdk8"
cask "java"
